TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0L1117/driverlib/empty_driverlib_src/ti/driverlib/dl_i2c.h
/** @enum DL_I2C_CLOCK */
typedef enum {
    /*!  BUSCLK enabled as I2C clock source */
    DL_I2C_CLOCK_BUSCLK = I2C_CLKSEL_BUSCLK_SEL_ENABLE,
    /*!  MFCLK enabled as I2C clock source */
    DL_I2C_CLOCK_MFCLK = I2C_CLKSEL_MFCLK_SEL_ENABLE,
} DL_I2C_CLOCK;

/** @enum DL_I2C_CLOCK_DIVIDE */
typedef enum {
    /*!  I2C Clock Divided by 1 */
    DL_I2C_CLOCK_DIVIDE_1 = I2C_CLKDIV_RATIO_DIV_BY_1,
    /*!  I2C Clock Divided by 2 */
    DL_I2C_CLOCK_DIVIDE_2 = I2C_CLKDIV_RATIO_DIV_BY_2,
    /*!  I2C Clock Divided by 3 */
    DL_I2C_CLOCK_DIVIDE_3 = I2C_CLKDIV_RATIO_DIV_BY_3,
    /*!  I2C Clock Divided by 4 */
    DL_I2C_CLOCK_DIVIDE_4 = I2C_CLKDIV_RATIO_DIV_BY_4,
    /*!  I2C Clock Divided by 5 */
    DL_I2C_CLOCK_DIVIDE_5 = I2C_CLKDIV_RATIO_DIV_BY_5,
    /*!  I2C Clock Divided by 6 */
    DL_I2C_CLOCK_DIVIDE_6 = I2C_CLKDIV_RATIO_DIV_BY_6,
    /*!  I2C Clock Divided by 7 */
    DL_I2C_CLOCK_DIVIDE_7 = I2C_CLKDIV_RATIO_DIV_BY_7,
    /*!  I2C Clock Divided by 8 */
    DL_I2C_CLOCK_DIVIDE_8 = I2C_CLKDIV_RATIO_DIV_BY_8,
} DL_I2C_CLOCK_DIVIDE;

/** @enum DL_I2C_TARGET_ADDRESSING_MODE */
typedef enum {
    /*! Enable Target in 7-bit addressing mode */
    DL_I2C_TARGET_ADDRESSING_MODE_7_BIT = I2C_SOAR_SMODE_MODE7,
    /*! Enable Target in 10-bit addressing mode */
    DL_I2C_TARGET_ADDRESSING_MODE_10_BIT = I2C_SOAR_SMODE_MODE10,
} DL_I2C_TARGET_ADDRESSING_MODE;

/** @enum DL_I2C_TARGET_PEC_STATUS */
typedef enum {
    /*!  I2C Target SMBus/PMBus PEC was checked in the transaction that occurred
     *   before the last Stop */
    DL_I2C_TARGET_PEC_STATUS_CHECKED = I2C_TARGET_PECSR_PECSTS_CHECK_SET,
    /*!  I2C Target SMBus/PMBus PEC was not checked in the transaction that
     *   occurred before the last Stop */
    DL_I2C_TARGET_PEC_STATUS_NOT_CHECKED =
        I2C_TARGET_PECSR_PECSTS_CHECK_CLEARED,
} DL_I2C_TARGET_PEC_STATUS;

/** @enum DL_I2C_TARGET_PEC_CHECK_ERROR */
typedef enum {
    /*!  Indicates PEC check error did not occurr in the transaction that
     *   occurred before the last Stop */
    DL_I2C_TARGET_PEC_CHECK_ERROR_CLEARED =
        I2C_TARGET_PECSR_PECSTS_ERROR_CLEARED,
    /*!  Indicates PEC check error occurred in the transaction that
     *   occurred before the last Stop */
    DL_I2C_TARGET_PEC_CHECK_ERROR_SET = I2C_TARGET_PECSR_PECSTS_ERROR_SET,
} DL_I2C_TARGET_PEC_CHECK_ERROR;

/** @enum DL_I2C_ANALOG_GLITCH_FILTER_WIDTH */
typedef enum {
    /*!  Pulses shorter than 5ns in length are filtered.  */
    DL_I2C_ANALOG_GLITCH_FILTER_WIDTH_5NS = I2C_GFCTL_AGFSEL_AGLIT_5,
    /*!  Pulses shorter than 10ns in length are filtered.  */
    DL_I2C_ANALOG_GLITCH_FILTER_WIDTH_10NS = I2C_GFCTL_AGFSEL_AGLIT_10,
    /*!  Pulses shorter than 25ns in length are filtered.  */
    DL_I2C_ANALOG_GLITCH_FILTER_WIDTH_25NS = I2C_GFCTL_AGFSEL_AGLIT_25,
    /*!  Pulses shorter than 50ns in length are filtered.  */
    DL_I2C_ANALOG_GLITCH_FILTER_WIDTH_50NS = I2C_GFCTL_AGFSEL_AGLIT_50,
} DL_I2C_ANALOG_GLITCH_FILTER_WIDTH;

/** @enum DL_I2C_DIGITAL_GLITCH_FILTER_WIDTH */
typedef enum {
    /*!  Pulses filtering disabled.  */
    DL_I2C_DIGITAL_GLITCH_FILTER_WIDTH_DISABLED = I2C_GFCTL_DGFSEL_DISABLED,
    /*!  Pulses shorter than 1 functional clock tick in length are filtered.  */
    DL_I2C_DIGITAL_GLITCH_FILTER_WIDTH_CLOCKS_1 = I2C_GFCTL_DGFSEL_CLK_1,
    /*!  Pulses shorter than 2 functional clock ticks in length are filtered.  */
    DL_I2C_DIGITAL_GLITCH_FILTER_WIDTH_CLOCKS_2 = I2C_GFCTL_DGFSEL_CLK_2,
    /*!  Pulses shorter than 3 functional clock ticks in length are filtered.  */
    DL_I2C_DIGITAL_GLITCH_FILTER_WIDTH_CLOCKS_3 = I2C_GFCTL_DGFSEL_CLK_3,
    /*!  Pulses shorter than 4 functional clock ticks in length are filtered.  */
    DL_I2C_DIGITAL_GLITCH_FILTER_WIDTH_CLOCKS_4 = I2C_GFCTL_DGFSEL_CLK_4,
    /*!  Pulses shorter than 8 functional clock ticks in length are filtered.  */
    DL_I2C_DIGITAL_GLITCH_FILTER_WIDTH_CLOCKS_8 = I2C_GFCTL_DGFSEL_CLK_8,
    /*!  Pulses shorter than 16 functional clock ticks in length are filtered.  */
    DL_I2C_DIGITAL_GLITCH_FILTER_WIDTH_CLOCKS_16 = I2C_GFCTL_DGFSEL_CLK_16,
    /*!  Pulses shorter than 31 functional clock ticks in length are filtered.  */
    DL_I2C_DIGITAL_GLITCH_FILTER_WIDTH_CLOCKS_31 = I2C_GFCTL_DGFSEL_CLK_31,
} DL_I2C_DIGITAL_GLITCH_FILTER_WIDTH;

/** @enum DL_I2C_CONTROLLER_DIRECTION */
typedef enum {
    /*! Set direction to controller transmitting to target */
    DL_I2C_CONTROLLER_DIRECTION_TX = I2C_MSA_DIR_TRANSMIT,
    /*! Set direction to controller receiving from target */
    DL_I2C_CONTROLLER_DIRECTION_RX = I2C_MSA_DIR_RECEIVE,
} DL_I2C_CONTROLLER_DIRECTION;

/** @enum DL_I2C_CONTROLLER_ADDRESSING_MODE */
typedef enum {
    /*! Enable Controller in 7-bit addressing mode */
    DL_I2C_CONTROLLER_ADDRESSING_MODE_7_BIT = I2C_MSA_MMODE_MODE7,
    /*! Enable Controller in 10-bit addressing mode */
    DL_I2C_CONTROLLER_ADDRESSING_MODE_10_BIT = I2C_MSA_MMODE_MODE10,
} DL_I2C_CONTROLLER_ADDRESSING_MODE;

/** @enum DL_I2C_CONTROLLER_PEC_STATUS */
typedef enum {
    /*!  I2C Controller SMBus/PMBus PEC was checked in the transaction that
     *   occurred before the last Stop */
    DL_I2C_CONTROLLER_PEC_STATUS_CHECKED =
        I2C_CONTROLLER_PECSR_PECSTS_CHECK_SET,
    /*!  I2C Controller SMBus/PMBus PEC was not checked in the transaction that
     *   occurred the last Stop */
    DL_I2C_CONTROLLER_PEC_STATUS_NOT_CHECKED =
        I2C_CONTROLLER_PECSR_PECSTS_CHECK_CLEARED,
} DL_I2C_CONTROLLER_PEC_STATUS;

/** @enum DL_I2C_CONTROLLER_PEC_CHECK_ERROR */
typedef enum {
    /*! I2C Controller SMBus/PMBus PEC check error occurred in the transaction
     *  before the last stop */
    DL_I2C_CONTROLLER_PEC_CHECK_ERROR_SET =
        I2C_CONTROLLER_PECSR_PECSTS_ERROR_SET,
    /*! I2C Controller SMBus/PMBus PEC check error did not occur in the
     *  transaction before the last stop */
    DL_I2C_CONTROLLER_PEC_CHECK_ERROR_CLEARED =
        I2C_CONTROLLER_PECSR_PECSTS_ERROR_CLEARED,
} DL_I2C_CONTROLLER_PEC_CHECK_ERROR;

/** @enum DL_I2C_CONTROLLER_SCL */
typedef enum {
    /*!  I2C SCL signal high */
    DL_I2C_CONTROLLER_SCL_HIGH = I2C_MBMON_SCL_SET,
    /*!  I2C SCL signal low */
    DL_I2C_CONTROLLER_SCL_LOW = I2C_MBMON_SCL_CLEARED,
} DL_I2C_CONTROLLER_SCL;

