TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0L1117/driverlib/empty_driverlib_src/ti/driverlib/dl_i2c.h
/**
 *  @brief      Enable Analog Glitch Suppression
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_enableAnalogGlitchFilter(I2C_Regs *i2c)
{
    i2c->GFCTL |= I2C_GFCTL_AGFEN_ENABLE;
}

/**
 *  @brief      Get direction of next controller operation
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     Direction of next controller operation
 *
 *  @retval     One of @ref DL_I2C_CONTROLLER_DIRECTION
 */
__STATIC_INLINE DL_I2C_CONTROLLER_DIRECTION DL_I2C_getControllerDirection(
    I2C_Regs *i2c)
{
    uint32_t direction = i2c->MASTER.MSA & I2C_MSA_DIR_MASK;

    return (DL_I2C_CONTROLLER_DIRECTION)(direction);
}

/**
 *  @brief      Set direction of next controller operation
 *
 *  @param[in]  i2c         Pointer to the register overlay for the peripheral
 *
 *  @param[in]  direction   Direction of next controller operation.
 *                          One of @ref DL_I2C_CONTROLLER_DIRECTION.
 */
__STATIC_INLINE void DL_I2C_setControllerDirection(
    I2C_Regs *i2c, DL_I2C_CONTROLLER_DIRECTION direction)
{
    DL_Common_updateReg(
        &i2c->MASTER.MSA, (uint32_t) direction, I2C_MSA_DIR_MASK);
}

/**
 *  @brief      Get the address of the target being addressed when configured
 *              as an I2C controller
 *
 *  Specifies bits A9 through A0 of the target address.
 *  In 7-bit addressing mode as selected by @ref DL_I2C_setTargetAddressingMode,
 *  the top 3 bits are don't care.
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     The target address
 *
 *  @retval     [0x00, 0x07FE]
 *
 *  @sa         DL_I2C_setTargetAddressingMode
 */
__STATIC_INLINE uint32_t DL_I2C_getTargetAddress(I2C_Regs *i2c)
{
    return ((i2c->MASTER.MSA & I2C_MSA_SADDR_MASK) >> I2C_MSA_SADDR_OFS);
}

/**
 *  @brief      Set the address of the target being addressed when configured
 *              as an I2C controller
 *
 *  Specifies bits A9 through A0 of the target address.
 *  In 7-bit addressing mode as selected by @ref DL_I2C_setTargetAddressingMode,
 *  the top 3 bits are don't care.
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *  @param[in]  targetAddress    Target address to set [0x00, 0x07FE]
 *
 *  @sa         DL_I2C_setTargetAddressingMode
 */
__STATIC_INLINE void DL_I2C_setTargetAddress(
    I2C_Regs *i2c, uint32_t targetAddress)
{
    DL_Common_updateReg(&i2c->MASTER.MSA, (targetAddress << I2C_MSA_SADDR_OFS),
        I2C_MSA_SADDR_MASK);
}

/**
 *  @brief      Get controller addressing mode
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     Addressing mode the controller is set to
 *
 *  @retval     One of @ref DL_I2C_CONTROLLER_ADDRESSING_MODE
 *
 */
__STATIC_INLINE DL_I2C_CONTROLLER_ADDRESSING_MODE
DL_I2C_getControllerAddressingMode(I2C_Regs *i2c)
{
    uint32_t mode = i2c->MASTER.MSA & I2C_MSA_MMODE_MASK;

    return (DL_I2C_CONTROLLER_ADDRESSING_MODE)(mode);
}

/**
 *  @brief      Set controller addressing mode between 7-bit and 10-bit mode
 *
 *  Selects the addressing mode between 7-bit and 10-bit mode to be used when
 *  device is configured as a controller
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *  @param[in]  mode    Addressing mode to set the target to.
 *                      One of @ref DL_I2C_CONTROLLER_ADDRESSING_MODE.
 */
__STATIC_INLINE void DL_I2C_setControllerAddressingMode(
    I2C_Regs *i2c, DL_I2C_CONTROLLER_ADDRESSING_MODE mode)
{
    DL_Common_updateReg(&i2c->MASTER.MSA, (uint32_t) mode, I2C_MSA_MMODE_MASK);
}

/**
 *  @brief      Disable controller ACK override
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_disableControllerACKOverride(I2C_Regs *i2c)
{
    i2c->MASTER.MCTR &= ~(I2C_MCTR_MACKOEN_MASK);
}

/**
 *  @brief      Checks if controller ACK override is enabled
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     If controller ACK override is enabled
 *
 *  @retval     true if controller ACK override is enabled
 *  @retval     false if controller ACK override is disabled
 */
__STATIC_INLINE bool DL_I2C_isControllerACKOverrideEnabled(I2C_Regs *i2c)
{
    return (
        (i2c->MASTER.MCTR & I2C_MCTR_MACKOEN_MASK) == I2C_MCTR_MACKOEN_ENABLE);
}

/**
 *  @brief      Enable controller ACK override
 *
 *  When enabled and the controller is receiving data and the number of bytes
 *  indicated in MCTR.MBLEN have been received, the state machine will generate
 *  an RXDONE interrupt and wait at the start of the ACK for FW to indicate if
 *  an ACK or NACK should be sent. The ACK or NACK is selected by writing the
 *  MCTR register and setting ACK accordingly. The other fields in this register
 *  can also be written at this time to continue on with the transaction. If a
 *  NACK is sent the state machine will automatically send a Stop.
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 * @sa          DL_I2C_setTransactionLength
 */
__STATIC_INLINE void DL_I2C_enableControllerACKOverride(I2C_Regs *i2c)
{
    i2c->MASTER.MCTR |= I2C_MCTR_MACKOEN_ENABLE;
}

/**
 *  @brief      Disable controller read on TX empty
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_disableControllerReadOnTXEmpty(I2C_Regs *i2c)
{
    i2c->MASTER.MCTR &= ~(I2C_MCTR_RD_ON_TXEMPTY_MASK);
}

/**
 *  @brief      Checks if controller read on TX empty is enabled
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     If controller read on TX empty is enabled
 *
 *  @retval     true if controller read on TX empty is enabled
 *  @retval     false if controller read on TX empty is disabled
 */
__STATIC_INLINE bool DL_I2C_isControllerReadOnTXEmptyEnabled(I2C_Regs *i2c)
{
    return ((i2c->MASTER.MCTR & I2C_MCTR_RD_ON_TXEMPTY_MASK) ==
            I2C_MCTR_RD_ON_TXEMPTY_ENABLE);
}

/**
 *  @brief      Enable controller read on TX empty
 *
 *  When enabled, the controller will transmit all bytes from the TX FIFO
 *  before continuing with the programmed Burst Run Read. If the DIR is not
 *  set to Read in the MSA then this bit is ignored. The Start must be set in
 *  the MCTR for proper I2C protocol. The controller will first send the Start
 *  Condition, I2C Address with R/W bit set to write, before sending the bytes
 *  in the TX FIFO. When the TX FIFO is empty, the I2C transaction will
 *  continue as programmed in MTCR and MSA without sending a Stop Condition.
 *  This is intended to be used to perform simple I2C command based reads
 *  transition that will complete after initiating them without having to get
 *  an interrupt to turn the bus around.
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 */
__STATIC_INLINE void DL_I2C_enableControllerReadOnTXEmpty(I2C_Regs *i2c)
{
    i2c->MASTER.MCTR |= I2C_MCTR_RD_ON_TXEMPTY_ENABLE;
}

/**
 *  @brief      Get the SMBus/PMBus Packet Error Checking (PEC) count value
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     The value the PEC count is set to
 *
 *  @retval     Value between [0x0, 0x01FF]
 */
__STATIC_INLINE uint32_t DL_I2C_getControllerPECCountValue(I2C_Regs *i2c)
{
    return (i2c->MASTER.CONTROLLER_I2CPECCTL &
            I2C_CONTROLLER_I2CPECCTL_PECCNT_MASK);
}

/**
 *  @brief      Set the SMBus/PMBus Packet Error Checking (PEC) count value
 *
 *  When this field is non zero, the number of I2C data bytes are counted.
 *  Refer to the device TRM for more details.
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *  @param[in]  count   The value to set the PEC count to.
 *                      Value between [0x0, 0x01FF]
 */
__STATIC_INLINE void DL_I2C_setControllerPECCountValue(
    I2C_Regs *i2c, uint32_t count)
{
    DL_Common_updateReg(&i2c->MASTER.CONTROLLER_I2CPECCTL, count,
        I2C_CONTROLLER_I2CPECCTL_PECCNT_MASK);
}

/**
 *  @brief      Disable controller SMBus/PMBus Packet Error Checking (PEC)
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_disableControllerPEC(I2C_Regs *i2c)
{
    i2c->MASTER.CONTROLLER_I2CPECCTL &= ~(I2C_CONTROLLER_I2CPECCTL_PECEN_MASK);
}

/**
 *  @brief      Checks if controller SMBus/PMBus Packet Error Checking (PEC)
 *              is enabled
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     If controller PEC is enabled
 *
 *  @retval     true if controller PEC is enabled
 *  @retval     false if controller PEC is disabled
 */
__STATIC_INLINE bool DL_I2C_isControllerPECEnabled(I2C_Regs *i2c)
{
    return ((i2c->MASTER.CONTROLLER_I2CPECCTL &
                I2C_CONTROLLER_I2CPECCTL_PECEN_MASK) ==
            I2C_CONTROLLER_I2CPECCTL_PECEN_ENABLE);
}

/**
 *  @brief      Enable controller SMBus/PMBus Packet Error Checking (PEC)
 *
 *  When enabled, the PEC is calculated on all bits accept the Start, Stop, ACK
 *  and NACK. The PEC LSFR and the Byte Counter is set to 0 when the State
 *  Machine is in the IDLE state, which occurs following a Stop or when a
 *  timeout occurs. The Counter is also set to 0 after the PEC byte is sent or
 *  received. Note that the NACK is automatically sent following a PEC byte
 *  that results in a PEC error.
 *  The PEC Polynomial is x^8 + x^2 + x^1 + 1.
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 */
__STATIC_INLINE void DL_I2C_enableControllerPEC(I2C_Regs *i2c)
{
    i2c->MASTER.CONTROLLER_I2CPECCTL |= I2C_CONTROLLER_I2CPECCTL_PECEN_ENABLE;
}

/**
 *  @brief      Get the current SMBus/PMBus PEC byte count of the controller
 *              state machine
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     The current PEC byte count of the controller state machine
 *
 *  @retval     Value between [0x0, 0x01FF]
 */
__STATIC_INLINE uint32_t DL_I2C_getControllerCurrentPECCount(I2C_Regs *i2c)
{
    return (
        i2c->MASTER.CONTROLLER_PECSR & I2C_CONTROLLER_PECSR_PECSTS_CHECK_MASK);
}

/**
 *  @brief      If controller SMBus/PMBus PEC was checked in last transaction
 *
 *  The status of if the controller PEC was checked in the transaction that
 *  occurred before the last Stop. Latched on Stop.
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     Status of controller PEC checked in last transaction
 *
 *  @retval     One of @ref DL_I2C_CONTROLLER_PEC_STATUS
 */
__STATIC_INLINE DL_I2C_CONTROLLER_PEC_STATUS
DL_I2C_getControllerPECCheckedStatus(I2C_Regs *i2c)
{
    uint32_t status =
        i2c->MASTER.CONTROLLER_PECSR & I2C_CONTROLLER_PECSR_PECSTS_CHECK_MASK;

